#Варіант 6 
#2. Написати програму, яка обчислюватиме об´єм і площу поверхні прямого колового циліндра. Користувач задає радіус циліндра і його висоту.
import math 

print("Програма для обчислення об´єму і площі поверхні прямого колового циліндра")

r = float( input("Введіть значення радіусу циліндра  "))
h = float( input("Введіть значення висоти циліндра  "))

S = 2*math.pi*r*h
V = math.pi*r**2*h

print("Площа бічної поверхні циліндра :", round(S,2) )
print("Об'єм циліндра :", round(V,2) )
