#Варіант 6 
#1. Куб  з  довжиною  ребра  х  розміщено  у  просторі  так,  що  його  грані паралельні координатним площинам,
# а точка перетину діагоналей співпадає з центром координат. Користувач задає координати точки у просторі, 
# а програма повинна визначити належність точки цьому кубу.
import math as m

x_cube = float(input("введіть значення для сторони куба: "))
x = float(input("\nвведіть координату \033[1mx:\033[0m "))
y = float(input("введіть координату \033[1my:\033[0m "))
z = float(input("введіть координату \033[1mz:\033[0m "))

def xyz_area ( x1, y1, z1, x_cube1):
    a = x1 <= x_cube1/2 and x1 >= -(x_cube1/2) and y1 <= x_cube1/2 and y1 >= -(x_cube1/2) and z1 <= x_cube1/2 and z1 >= -(x_cube1/2)
    return (a)

if m.pow( x, 2 ) + m.pow( y, 2 ) + m.pow( z, 2 ) <= (x_cube)*3 and xyz_area ( x, y, z, x_cube):
    print ("\nточка \033[1mНАЛЕЖИТЬ\033[0m кубу\n")
else:
    print ("\nточка \033[1mНЕ НАЛЕЖИТЬ\033[0m кубу\n")
