#Варіант 6 
#1. Куб  з  довжиною  ребра  х  розміщено  у  просторі  так,  що  його  грані паралельні координатним площинам,
# а точка перетину діагоналей співпадає з центром координат. Користувач задає координати точки у просторі, 
# а програма повинна визначити належність точки цьому кубу.
import math as m

x_cube = float(input("введіть значення для сторони куба: "))
x = float(input("\nвведіть координату \033[1mx:\033[0m "))
y = float(input("введіть координату \033[1my:\033[0m "))
z = float(input("введіть координату \033[1mz:\033[0m "))

def xyz_area ( x, y, z, x_cube):
    a = x <= x_cube/2 and x >= -(x_cube/2) and y <= x_cube/2 and y >= -(x_cube/2) and z <= x_cube/2 and z >= -(x_cube/2)
    return (a)

if m.pow( x, 2 ) + m.pow( y, 2 ) + m.pow( z, 2 ) <= (x_cube)*3 and xyz_area ( x, y, z, x_cube):
    print ("\nточка належить кубу\n")
else:
    print ("\nточка \033[1mНЕ\033[0m належить кубу\n")