#Варіант 6 
#2.  Протабулювати  функцію  в  діапазоні  [a;b]  з  кроком  h  за  допомогою циклу з передумовою. Значення a, b, h вводяться з клавіатури.
import math as m

x = float( input("введіть значення \033[1mx:\033[0m "))
a = int( input("\nвведіть початкове значення лічильника \033[1ma:\033[0m "))
b = int( input("введіть кінцеве значення лічильника \033[1mb:\033[0m "))
h = float( input("введіть значення кроку циклу і x: "))
 

while a < b:
    y = m.sin(x + m.pi) + m.cos(x + m.log( m.fabs(x), m.e ))
    print ( y, "\n")
    x = x + h
    a = a + h
