#Варіант 6 
#3. Записати всі значення аргументу і функції у вкладений список (2 рядки). Вивести на екран вкладений список. Вивести на екран суму значень функції на проміжку. 
import math as m

x = float( input("введіть значення \033[1mx:\033[0m "))
a = int( input("\nвведіть \033[1ma:\033[0m "))
b = int( input("введіть \033[1mb:\033[0m "))
h = int( input("введіть значення кроку циклу: "))
 
for i in range(a, b + 1, h):
    y = m.sin(x + m.pi) + m.cos(x + m.log( m.fabs(x), m.e ))
    lst = [
            [x],
            [y]
            ]
    print (lst, "\n") 
    x = x + h

